{
  "config" : {
    "admins" : {},
    "cfp_open" : true,
    "event_dates" : [ "2018-04-12", "2018-04-13" ],
    "event_name" : "Chicago Roboto",
    "event_year" : "2018",
    "review_open" : false,
    "reviewers" : {
      "-Kxyfzoe_4X-ctI_yH2T" : "ryanjharter@gmail.com"
    },
    "session_levels" : [ "All" ]
  },
  "profiles" : {
    "6aubESniVrUJCCmMfs7gGQ5ciYU2" : {
      "id": "6aubESniVrUJCCmMfs7gGQ5ciYU2",
      "agree_terms" : true,
      "bio" : "Jerrell Mardis (@jerrellmardis) is a Google Developer Expert for Android, an Android engineer at Salesforce.com and an organizer for Google Developer Group Chicago West. Through his work as a public speaker and community organizer, Jerrell hopes to help elevate the tech community scene in Chicago. He has been developing apps for Android since Android 2.0 and is passionate about building beautiful and functional Android apps that exceed users' expectations. He is also the creator of the successful transit application, Ride Metra.",
      "company" : "Salesforce",
      "email" : "jerrell.mardis@gmail.com",
      "name" : "Jerrell Mardis",
      "title" : "Lead Android Engineer",
      "twitter" : "@jerrellmardis"
    },
    "8DqZcx3zHoOPuTT1MHM493bpfIF3" : {
      "id": "8DqZcx3zHoOPuTT1MHM493bpfIF3",
      "agree_terms" : true,
      "bio" : "Dan has been an Android programmer at Basecamp for 3 years, and prior to that had been working with Java for...a long time. \n\nHe's always enjoyed Android development, but working with Kotlin over the last two years has rocketed that enthusiasm to a whole new level. The Android community has been instrumental to his work and career, and he's a big believer in paying that forward.\n\nOutside of work, he's an avid Dad 👴, donut aficionado 🍩, pizza lover 🍕, and emoji enthusiast 😉.",
      "company" : "Basecamp",
      "email" : "dan@basecamp.com",
      "name" : "Dan Kim",
      "title" : "Programmer",
      "twitter" : "@dankim"
    },
    "OrviRlXkHySeGk9LorOCrV6kCwI3" : {
      "id": "OrviRlXkHySeGk9LorOCrV6kCwI3",
      "agree_terms" : true,
      "bio" : "I'm the Android developer at Pixite where I work on Pigment, and I'm also a Google Developer Expert.  I've been developing Android apps since 2009 and love working on anything fun, usually graphics related.",
      "company" : "Pixite",
      "email" : "ryanjharter@gmail.com",
      "name" : "Ryan Harter",
      "title" : "Android Developer",
      "twitter" : "@rharter"
    }
  },
  "schedule" : {
    "-Kyta2X6gvz6tNeIZgyJ" : {
      "end_time" : "2018-04-12T12:00:00-0500",
      "event_type" : "session",
      "level" : "0",
      "room" : "Main",
      "speakers" : [ "nIiy8GJDcXYiRQfIwDRV74fkA6B2" ],
      "start_time" : "2018-04-12T11:45:00-0500",
      "submission_id" : "-Kyta2X6gvz6tNeIZgyJ"
    },
    "-L05aVkr2wuZxr7IWT88" : {
      "end_time" : "2018-04-12T11:30:00-0500",
      "event_type" : "session",
      "level" : "0",
      "room" : "Main",
      "speakers" : [ "U2Y8xPbQCUTxkErE7dR74dtfoly1" ],
      "start_time" : "2018-04-12T11:00:00-0500",
      "submission_id" : "-L05aVkr2wuZxr7IWT88"
    },
    "-L1Y4_8Wb9Y_bf3AKBTL" : {
      "end_time" : "2018-04-12T10:45:00-0500",
      "event_type" : "session",
      "level" : "0",
      "room" : "Main",
      "speakers" : [ "OiimvTKxeWcCsmaaw63VGcTdMTJ3" ],
      "start_time" : "2018-04-12T10:00:00-0500",
      "submission_id" : "-L1Y4_8Wb9Y_bf3AKBTL"
    },
    "-L1ZYz-3uEBPZf0LPoPI" : {
      "end_time" : "2018-04-12T09:45:00-0500",
      "event_type" : "session",
      "level" : "0",
      "room" : "Main",
      "speakers" : [ "ng4L290T54Q3WsqGwvS3e1TIiDG3" ],
      "start_time" : "2018-04-12T09:00:00-0500",
      "submission_id" : "-L1ZYz-3uEBPZf0LPoPI"
    }
  },
  "sessions": {
    "-L1ZYz-3uEBPZf0LPoPI" : {
      "abstract" : "Changes in the Android world happen so rapidly. There isn’t one right way to do something and documentation doesn’t always keep up. And sometimes you may feel that you can’t keep up. So how do you as a developer - keep up with an ever changing field, make sure your workplace and community catches up, make sure you are using the right tools to make beautiful apps a reality, and work with people from design, product and/or marketing who may not have worked on the Android ecosystem before? Let’s talk about how you can be an Android developer who brings teams and communities together. \n",
      "start_time": "2018-04-12T09:00:00-0500",
      "end_time": "2018-04-12T09:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "comments" : {
        "KJ17IrpIISTfjfCufr5rnglWoU53" : "This is a great topic for keynote"
      },
      "duration" : 40,
      "notes" : "I'm interested in giving a keynote and decided to submit this abstract. I have spoken at several conferences before and feel that my 7 years of professional experience in the Android world and 3 years of community experience as a GDG co-organizer and conference speaker will help me give a keynote that is applicable to all levels of Android developers. All my previous talks are available at http://www.yprabhu.com/p/speaking.html. Thank you!",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 3
      },
      "speakers" : ["ng4L290T54Q3WsqGwvS3e1TIiDG3"],
      "title" : "Keynote: Being more than an Android developer"
    },
    "-L1Y4_8Wb9Y_bf3AKBTL" : {
      "abstract" : "Architecture Components were announced to much fanfare at Google I/O 2017, as it finally gave Android developers some official guidance on how to architect their applications.  It also gave us tools to make managing lifecycle changes much easier, and to persist data without writing lots of annoying SQLite boilerplate code.  By now we’ve all read the documentation and tutorials, but how easy is it to use these intriguing new tools in a production application? (Spoiler alert: they’re pretty helpful)\n\nI developed an app from scratch using all of the new Architecture Components - ViewModels and an MVVM architecture, Room to persist all the local data, and LiveData objects to easily and safely update the UI with automatic lifecycle handling.  Join us as we discuss in detail what it’s like to use these new Architecture Components in a real world situation - we’ll talk about the problems they solved, the problems they created, and whether or not they’re the right choice for your next project.",
      "start_time": "2018-04-12T10:00:00-0500",
      "end_time": "2018-04-12T10:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "duration" : 40,
      "notes" : "I was lucky enough to speak at the inaugural Chicago Roboto 2017 and had an incredible experience, and would love the opportunity to speak again in 2018.  I also spoke at the first droidcon Boston in 2017, and have spoken at various Android meetups and tech events around Toronto.\n\nMy company should be able to help cover at least some (if not all) of the costs.\n\nHere are some of my previous presentations:\n\nhttps://news.realm.io/news/android-auto-drive-your-car-use-your-phone-dont-get-hurt/\nhttps://www.youtube.com/watch?v=GeSKaz6PCm4\nhttps://www.youtube.com/watch?v=WNaJlP36I4E\nhttps://www.youtube.com/watch?v=UsX2ySEKbYw\nhttps://vimeo.com/217597546\nhttps://speakerdeck.com/physphil",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 3
      },
      "speakers" : ["OiimvTKxeWcCsmaaw63VGcTdMTJ3"],
      "title" : "I Wrote an App Using all of the Architecture Components... And Here’s How It Turned Out."
    },
    "-L05aVkr2wuZxr7IWT88" : {
      "abstract" : "Starting out in a new career is scary.  Learning new technologies, navigating company and career goals, staying up-to-date in a constantly changing ecosystem; it can be overwhelming. \n\nOver the last several years, I’ve learned a number of things (sometimes the hard way) that I’d love to share with my past self.\n\nIn this talk, I’ll share that advice with you. \n\nWe'll explore tips & lessons learned from personal experiences learning Android, starting that 1st professional role, developing your skills, and interacting with the community.",
      "start_time": "2018-04-12T11:00:00-0500",
      "end_time": "2018-04-12T11:20:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "duration" : "20",
      "notes" : "This is a topic near and dear to my heart.  I really believe strongly in developing an inclusive community that includes helping new students/professionals feel welcome, and helping them understand that it's absolutely normal to feel lost and overwhelmed at times.\n\nI've shared a little about my experiences before, https://medium.com/udacity/my-year-with-udacitys-android-nanodegree-e8dab119b085\nI'm organizing a meetup for Udacity students/alumni that will discuss some of these same topics as well: https://www.meetup.com/Udacious-Seattle/",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 2,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 2,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 3
      },
      "speakers" : ["U2Y8xPbQCUTxkErE7dR74dtfoly1"],
      "title" : "Tips From the Time Machine: Things I Wish I'd Known When Starting a Career as an Android dev"
    },
    "-Kyta2X6gvz6tNeIZgyJ" : {
      "abstract" : "Working with Android studio Template is fun, productive and efficient developing application in groups. It saves the developer time and facilitates to follow the common coding conventions throughout the organization with ease. By creating efficient templates, developer can focus on other business logic, requirements and architecture rather spending time on doing repetitive tasks all over the day. Yeah! Android Studio Templates are user-friendly which provides cool UI and can be customized according to the industry standards by just editing the templates class files.",
      "start_time": "2018-04-12T11:25:00-0500",
      "end_time": "2018-04-12T11:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "duration" : "20",
      "notes" : "Blogs on Template Creation : \n\n1. https://medium.com/androidstarters/mastering-android-studio-templates-ed8fdd98cb78\n2. https://medium.com/androidstarters/creating-android-studio-ide-template-for-recyclerviews-a8b6d4925f3f\n\nGithub Repository:\n\n1. https://github.com/TakeoffAndroid/RecyclerViewTemplate\n2. https://github.com/TakeoffAndroid/MaterialTabsTemplate",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 2,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["nIiy8GJDcXYiRQfIwDRV74fkA6B2"],
      "title" : "Mastering Android Studio Template Creation"
    },
    "-L-sGVYC5vHBmdl-2apa" : {
      "abstract" : "ConstraintLayout 2.0 will be introduced early 2018, with many new features. This talk will present those new features and concepts. If possible, we would like the abstract to be updated once the release is out.",
      "start_time": "2018-04-12T13:00:00-0500",
      "end_time": "2018-04-12T13:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "comments" : {
        "KJ17IrpIISTfjfCufr5rnglWoU53" : "top"
      },
      "duration" : 40,
      "notes" : "John Hoford hoford@google.com will be my co-presenter",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["hXvsojyRLxcJyWaXK8gcocL7Zlf1"],
      "title" : "ConstraintLayout 2.0"
    },
    "-L-2S4rWWRVi2OlUEpRR" : {
      "abstract" : "Mark Allison (author of https://blog.stylingandroid,com) has a deep love of VectorDrawable. He has spoken at conferences about how to construct and Animate them in his talk entitled \"Vector All The Things\".\n\nIn this all new talk, Mark will look at some of the features which have been added to VectorDrawable and its sibling AnimatedVectorDrawable since they first appeared in Android Lollipop 5.0 (API 21). There will be a dive in to fill windings which can cause some baffling rendering oddities, yet can be quite simple to fix once you recognise that fill windings are the cause; There will also be a look at the recently added gradient support; And, of course, there will be plenty of tricks and tips to help with your creation of fabulous VectorDrawables, and amazing Animations.",
      "start_time": "2018-04-12T14:00:00-0500",
      "end_time": "2018-04-1214:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "duration" : 40,
      "notes" : "I will require flights and accommodation to be covered, but may be able to receive some financial assistance from Google toward this (for Chicago Roboto last year, Google paid for my flights, and the organisers only needed to cover my accommodation). However last year was complicated because it was left late, and flight prices has increased, and Google's budget had been largely used up. Therefore the earlier that you could confirm whether I have had a talk accepted, the more likely it is that I shall be able to get some financial assistance from Google.",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["P8iQ35ohxFTkl9z2HO7Ts1HUB0R2"],
      "title" : "wow. very vector. such love"
    },
    "-L0R7e0jvXReu7pzpOth" : {
      "abstract" : "ADB is maybe one of the most used tools by the Android developers. But it is for sure the less known. \nIf you ever wondered how ADB is working? Why is it faster now? How Android Studio is using it under the hood? Why my ADB server is killed sometimes? And by the way, what this server is about? This talk is made for you. \n\nI spent several weeks diving into the ADB source code and I learned interesting things about this project, its history, the internals, the interaction with the developers tools, ... It's time for me to share this with you. \n\nHere is an outline of the presentation: \n- How ADB works (the big picture) \n- Some ADB commands you maybe never heard about \n- The history of the project \n- The ADB Internals (the ADB protocols, the structure of the software)\n- How development tools are using ADB?",
      "start_time": "2018-04-12T15:00:00-0500",
      "end_time": "2018-04-12T15:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "duration" : "45",
      "notes" : "I already gave the talk at Droidcon NYC (https://www.youtube.com/watch?v=dzx81sAKylg) and Paris Android User Group (https://www.youtube.com/watch?v=aLNsa1Kjve8).",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["r0XXHLRqPmd3YpwBrJkkbJlZtQ62"],
      "title" : "ADB, Break On Through To the Other Side"
    },
    "-L1DYvhOuHCYofznm459" : {
      "abstract" : "RxJava is an incredibly nice library that lets us take our data on a journey through network calls, databases, UI threads and background threads. But how do we actually achieve concurrency, responsibly? Are we testing it to ensure our own sanity? Are we protecting ourselves against race conditions? Is flatMap() and merge() enough? Demonstrating an understanding in creating and testing Rx streams helps us to achieve concurrency in this powerful library.",
      "start_time": "2018-04-12T16:00:00-0500",
      "end_time": "2018-04-12T16:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "duration" : 40,
      "notes" : "Hi Chicago Roboto! I'm currently an Android Developer at Yello.co. I love working with the RxJava framework and how easy it's made our Android app to maintain.\n\nI really want to do a talk on concurrency with this widely-popular framework because, as a junior developer learning all of the pitfalls of concurrency, it's opened my eyes to all the ways we can shoot ourselves in the foot. I wrote this article (https://proandroiddev.com/testing-concurrency-in-rxjava-831804a9e526) in Pro Android Dev to contribute some of what I've learned, but I realized I could do an entire talk on the subject!\n\nI'm hoping to cover a more broad approach to concurrency and leave viewers with a more rounded-out view of how things happen in the framework.\n\nI've never spoken at a conference (at the time of the writing of this proposal) but in January I will have done a talk called Privet Kotlin at Windy City Dev Fest. Here's a link: https://windycity.devfest.io/sessions/-L0GMdpLLWSmT68IqRkO",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 2,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["GR6IHwqOLOQmwdNIlF4ETRVnAWG2"],
      "title" : "Achieving Concurrency in RxJava"
    },
    "-KysBHqCHfvCEV6OaTnP" : {
      "abstract" : "Are you one of the numerous developers who wants to implement Espresso testing but hasn't? Perhaps it's for one of the common reasons - not enough expertise or time, it feels like a daunting task, or it feels downright tedious. I have personally felt each of those things. All of that changed once I learned about the robot pattern. In this talk we'll go over how the robot pattern helps you write cleaner and more maintainable tests, as well as how it can be leveraged for better test reporting. You'll walk away with an understanding of how to write tests much more thoroughly and efficiently so that it can easily become a natural part of your build process, and not shoved in the back log and left untouched. \n",
      "start_time": "2018-04-12T17:00:00-0500",
      "end_time": "2018-04-12T17:45:00-0500",
      "date" : "2018-04-12",
      "accepted" : true,
      "duration" : 40,
      "notes" : "A short blog post I've written on this topic, though I plan for the talk to go more in depth - https://androidessence.com/android/leveraging-the-robot-pattern-for-espresso-tests/",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 2,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["KtiwOUeigvUxn0MUHtJyvCLpOnS2"],
      "title" : "Espresso Patronum: The Magic Of The Robot Pattern"
    },
    "-L1ZrO-T1SS0UzjrX4Gs" : {
      "abstract" : "Even if you’re brand new to Kotlin, you might know that you can right-click any Java file and convert it automatically. Score! But wait, what are all these “!!” and why is the code littered with “?”. Sure, the code compiles, but how do you make the code not just compile but follow best practices? How do you get closer to making your code idiomatic?\n\nIn the third part of our series on learning the cool and idiomatic parts of Kotlin, we're going to look at some intermediate Kotlin topics. We're going to look at how inlining can improve the performance on higher-order functions as well as allow us to take advantage of type reification. Then we'll take a look at how delegation can help us write dryer, more efficient, and more interesting properties with less boiler plate. Finally, we'll dive into the magical world of asynchronous programming the Kotlin way with coroutines.",
      "start_time": "2018-04-13T09:00:00-0500",
      "end_time": "2018-04-13T09:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : "45",
      "notes" : "My co-presenter will be Christina Lee.\n\nBoth of us spoke at Chicago Roboto last year.\nHuyen Tue Dao, \"Cool ConstraintLayout\": https://youtu.be/Xx4aRI3oQbM\nChristina Lee, \"Retrofitting Retrofit\"\n",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["c8LiYaJFquRYKMqVmYeZgTSFaVe2"],
      "title" : "The Road to Kotlintown III: Delegate 95 to Coroutine 66"
    },
    "-L-G9e3es-COhq0M650L" : {
      "abstract" : "Tofus (□) are representations used when a specific character (like an Emoji) cannot be displayed. You have seen them, and so your users.\n\nThanks to EmojiCompat, now Android developers have a way to provide Emoji compatibility for older devices, but does it solve all the issues developers have with Emoji? \n\nHave you wondered why Twitter counts characters differently depending on the Emoji? Or how gender and skin tone Emoji modifiers work? How can I have a similar functionality as Slack on my app with custom Emoji? Do all your users see the same Emoji?\n\nOn this talk, you will learn about the different pitfalls developers face when working with Emoji, like code points, the Fitzpatrick modifiers and short-names, you will learn how to use EmojiCompat and I will show you alternatives to it.\n\nIn this talk you will learn:\n- What are the problems developers face with Emoji\n- How Emoji works\n- How to use EmojiCompat including dynamic font downloading\n- What is EmojiCompat not solving, and what can you do\n- What alternatives are there to EmojiCompat\n- ..and of course everything with Kotlin!\n\nAfter this talk, you will be an Emoji expert, no longer afraid of showing □ (tofu) to your users!\n",
      "start_time": "2018-04-13T10:00:00-0500",
      "end_time": "2018-04-13T10:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : 40,
      "notes" : "This will be an improved and extended version of the talk I gave on the Berlindroid meetup event back in summer. Here’s a summary on how the talk went: https://medium.com/@Miqubel/talk-no-more-taming-emoji-on-android-c4f3825e510c \n\nThis talk will include as well code samples for the attendees in a GitHub repo.\n\nI am very interested in this topic: At work we used to have a custom solution for displaying Emoji until EmojiCompat came out, and we used to do a lots of tricks to support the latest Unicode Emoji specs, since we are a social network that uses Emoji a lot. We are early adopters of EmojiCompat, using it since it’s beta release.\n\nI think this is an interesting topic that usually doesn’t get enough attention but can affect anyone who is dealing with user generated content.\n\nI will also be giving a talk in February on the DroidKaigi conference in Tokyo, and I’ve also given two talks at the Berlin DevFest. All of them about different topics. You can check my speaker deck: https://speakerdeck.com/miquelbeltran If you need more references, my Medium articles have been published both at AndroidWeekly and KotlinWeekly\n",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 2,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["NKfa7i1ya1codCObZxEyvBpvv5p1"],
      "title" : "No More □  —  Mastering Emoji on Android"
    },
    "-L1aXPSRjrfFiFS-sksm" : {
      "abstract" : "Although it is buzzing nowadays, machine learning is still a stranger to many of us.\nHowever, worry not! Making your app smarter has just become wayyy easier with the new TensorFlow for Android.\nOn this talk, we’ll get to know some basic ML concepts and usages, and create our first machine learning Android app using TensorFlow!\n",
      "start_time": "2018-04-13T11:00:00-0500",
      "end_time": "2018-04-13T11:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : "45",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 3,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["zzqX4y5e5yMTVLvIEfsItp4NCp52"],
      "title" : "Who’s afraid of Machine Learning? First steps with TensorFlow for Android."
    },
    "-L1Zag9BgNhutvZebqO8" : {
      "abstract" : "Picasso is a powerful image downloading and caching library for Android but since its launch in 2013, other libraries have improved or entered the scene and new requirements have come up.  \n\nIn this talk, we’ll:\n* Dig into the internals of Picasso works\n* Compare and contrast to other image libraries\n* Discuss latest improvements as we push to 3.0\n* ...and more!\n\nYou’ll learn to efficiently work with different image formats across millions of devices!",
      "start_time": "2018-04-13T13:00:00-0500",
      "end_time": "2018-04-13T13:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : 40,
      "notes" : "https://speakerdeck.com/jrodbx",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 2,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["MN4HNiWM7qW96xzbGkRphXprApu1", "ayE1XDMvl2cPi8Sa6bN45l9QLKG2"],
      "title" : "Rinsing the Brush: Picasso 3.0"
    },
    "-L1453alPCtSTM9843Jy" : {
      "abstract" : "We have had many talks and blog posts on Dagger till now and people have done a great job at explaining it's various concepts. Dagger is something which has become a part of our coding lives now. Yet, from time-to-time we still find ourselves lost while dealing with “The Dahaka (an infinite storm in an ocean of Providers, Factories, Builders, MemberInjectors, DoubleChecks, Lazy, Producers...)”. \n\nStarting to learn about Dagger? Start by creating a Module and a Component. Add a Singleton scope to it. \nDependencies getting out of hand? Create another dependent component.\nCreating a dependent component? You should create another scope!! \nCreate a subcomponent.\nStill alive? Now we present you with Dagger Android and I am sure that it will certainly kill you :P\n\nBut wait! What exactly is the relation between a Module and a Component? \n\nThankfully! Dagger 2 generates all it’s code at compile time and we can actually see what’s going on behind the scenes.\n\nIn this talk we will aim to Defeat “The Dahaka (a storm in the ocean of generated classes)”. After attending this talk you will get a better sense of what goes on behind the scenes and how to smartly move to Dagger Android  :)\n",
      "start_time": "2018-04-13T14:00:00-0500",
      "end_time": "2018-04-13T14:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : 40,
      "notes" : "For more information, series “Dagger and The Dahaka” on medium : https://proandroiddev.com/dagger-2-android-defeat-the-dahaka-b1c542233efc\n\nI gave a similar talk at Droidcon Berlin, 2017 https://droidcon.de/en/sessions/dagger-2-android-defeat-dahaka\n\nDemo code : https://github.com/ragdroid/Dahaka",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["kxTClM2ee3fSZmLQe1C4usE8Br13"],
      "title" : "Dagger 2 Android : Defeat the Dahaka"
    },
    "-KxynTzs-dXn0PCuVJdf" : {
      "abstract" : "Writing high-quality path morphing animations for Android is a near impossible task. In order to morph one shape into another, the SVG paths describing the two must be compatible with each other—that is, they need to have the same number and type of drawing commands. Unfortunately popular design tools, such as Sketch and Illustrator, do not take this into account, and as a result engineers will often have to spend time tweaking the raw SVGs given to them by designers before they can be morphed. To address this issue, I built a web app called Shape Shifter (https://shapeshifter.design), a tool that helps developers and designers to more easily create path morphing animations for their Android apps. In this talk, I will explain how to use Shape Shifter to create seamless transitions between arbitrary shapes using AnimatedVectorDrawables. I will also explain how Shape Shifter internally uses bioinformatics algorithms in order to auto-generate morphing animations between incompatible shapes, as well as some of the challenges I faced while building the tool.",
      "start_time": "2018-04-13T15:00:00-0500",
      "end_time": "2018-04-13T15:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : "45",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
      },
      "speakers" : ["MkYEWfwwHMeODXHCmn9yp5nsNvZ2"],
      "title" : "In-depth path morphing w/ Shape Shifter"
    },
    "-L1ZPfPC0rO8qTQ3umb3" : {
      "abstract" : "Every day each one of us turns to community contributions to help us become better developers — blog posts, open source projects, conference talks, podcasts, and so much more. Can you imagine if these community resources didn’t exist?!\n\nAnd while our community is strong today, it’s healthiest when it continues to grow from a broad set of interests, backgrounds and opinions. That diversity and knowledge to keep our community strong can only come from one place: YOU.\n\nI’ll share my thoughts about how this community has helped me (and others) grow, why that’s so important, and ultimately why it’s crucial for all of us to contribute. I’ll discuss five (or so) areas, each with some high level tips to get you started, that we can all contribute to to keep our community strong and healthy.\n\nThe Android community has proven to be one of the most welcoming, friendly, helpful, generous groups I’ve ever encountered. Let’s keep it going!",
      "start_time": "2018-04-13T16:00:00-0500",
      "end_time": "2018-04-13T16:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : "30-40",
      "notes" : "Previous talk:\nhttps://www.youtube.com/watch?v=fsUF5f4GnHc\nhttps://speakerdeck.com/dankim/getting-to-100-percent-kotlin-a-practical-guide",
      "scores" : {
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 2
      },
      "speakers" : ["8DqZcx3zHoOPuTT1MHM493bpfIF3"],
      "title" : "The future of our community is YOU"
    },
    "ar-core": {
      "abstract" : "Google introduced ARCore for Android in August of last year. This is your opportunity to step in on the ground floor of the developing potential around augmented reality on mobile. We’ll walk through some of the fundamental capabilities, things to avoid, why you might want to use it, and some resources that might be helpful for you.",
      "start_time": "2018-04-13T17:00:00-0500",
      "end_time": "2018-04-13T17:45:00-0500",
      "date" : "2018-04-13",
      "accepted" : true,
      "duration" : "45",
      "speakers" : ["ngt0jsbDYDew0CUdODzMP54XU0l1"],
      "title" : "Intro to ARCore"
    }
  },
  "sessions_by_date": {
    "2018-04-12": [
      {
        "abstract" : "Changes in the Android world happen so rapidly. There isn’t one right way to do something and documentation doesn’t always keep up. And sometimes you may feel that you can’t keep up. So how do you as a developer - keep up with an ever changing field, make sure your workplace and community catches up, make sure you are using the right tools to make beautiful apps a reality, and work with people from design, product and/or marketing who may not have worked on the Android ecosystem before? Let’s talk about how you can be an Android developer who brings teams and communities together. \n",
        "id": "-L1ZYz-3uEBPZf0LPoPI",
        "start_time": "2018-04-12T09:00:00-0500",
        "end_time": "2018-04-12T09:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "comments" : {
          "KJ17IrpIISTfjfCufr5rnglWoU53" : "This is a great topic for keynote"
        },
        "duration" : 40,
        "notes" : "I'm interested in giving a keynote and decided to submit this abstract. I have spoken at several conferences before and feel that my 7 years of professional experience in the Android world and 3 years of community experience as a GDG co-organizer and conference speaker will help me give a keynote that is applicable to all levels of Android developers. All my previous talks are available at http://www.yprabhu.com/p/speaking.html. Thank you!",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 3
        },
        "speakers" : ["ng4L290T54Q3WsqGwvS3e1TIiDG3"],
        "title" : "Keynote: Being more than an Android developer"
      },
      {
        "abstract" : "Architecture Components were announced to much fanfare at Google I/O 2017, as it finally gave Android developers some official guidance on how to architect their applications.  It also gave us tools to make managing lifecycle changes much easier, and to persist data without writing lots of annoying SQLite boilerplate code.  By now we’ve all read the documentation and tutorials, but how easy is it to use these intriguing new tools in a production application? (Spoiler alert: they’re pretty helpful)\n\nI developed an app from scratch using all of the new Architecture Components - ViewModels and an MVVM architecture, Room to persist all the local data, and LiveData objects to easily and safely update the UI with automatic lifecycle handling.  Join us as we discuss in detail what it’s like to use these new Architecture Components in a real world situation - we’ll talk about the problems they solved, the problems they created, and whether or not they’re the right choice for your next project.",
        "id": "-L1Y4_8Wb9Y_bf3AKBTL",
        "start_time": "2018-04-12T10:00:00-0500",
        "end_time": "2018-04-12T10:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "duration" : 40,
        "notes" : "I was lucky enough to speak at the inaugural Chicago Roboto 2017 and had an incredible experience, and would love the opportunity to speak again in 2018.  I also spoke at the first droidcon Boston in 2017, and have spoken at various Android meetups and tech events around Toronto.\n\nMy company should be able to help cover at least some (if not all) of the costs.\n\nHere are some of my previous presentations:\n\nhttps://news.realm.io/news/android-auto-drive-your-car-use-your-phone-dont-get-hurt/\nhttps://www.youtube.com/watch?v=GeSKaz6PCm4\nhttps://www.youtube.com/watch?v=WNaJlP36I4E\nhttps://www.youtube.com/watch?v=UsX2ySEKbYw\nhttps://vimeo.com/217597546\nhttps://speakerdeck.com/physphil",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 3
        },
        "speakers" : ["OiimvTKxeWcCsmaaw63VGcTdMTJ3"],
        "title" : "I Wrote an App Using all of the Architecture Components... And Here’s How It Turned Out."
      },
      {
        "abstract" : "Starting out in a new career is scary.  Learning new technologies, navigating company and career goals, staying up-to-date in a constantly changing ecosystem; it can be overwhelming. \n\nOver the last several years, I’ve learned a number of things (sometimes the hard way) that I’d love to share with my past self.\n\nIn this talk, I’ll share that advice with you. \n\nWe'll explore tips & lessons learned from personal experiences learning Android, starting that 1st professional role, developing your skills, and interacting with the community.",
        "id" : "-L05aVkr2wuZxr7IWT88",
        "start_time": "2018-04-12T11:00:00-0500",
        "end_time": "2018-04-12T11:20:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "duration" : "20",
        "notes" : "This is a topic near and dear to my heart.  I really believe strongly in developing an inclusive community that includes helping new students/professionals feel welcome, and helping them understand that it's absolutely normal to feel lost and overwhelmed at times.\n\nI've shared a little about my experiences before, https://medium.com/udacity/my-year-with-udacitys-android-nanodegree-e8dab119b085\nI'm organizing a meetup for Udacity students/alumni that will discuss some of these same topics as well: https://www.meetup.com/Udacious-Seattle/",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 2,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 2,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 3
        },
        "speakers" : ["U2Y8xPbQCUTxkErE7dR74dtfoly1"],
        "title" : "Tips From the Time Machine: Things I Wish I'd Known When Starting a Career as an Android dev"
      },
      {
        "abstract" : "Working with Android studio Template is fun, productive and efficient developing application in groups. It saves the developer time and facilitates to follow the common coding conventions throughout the organization with ease. By creating efficient templates, developer can focus on other business logic, requirements and architecture rather spending time on doing repetitive tasks all over the day. Yeah! Android Studio Templates are user-friendly which provides cool UI and can be customized according to the industry standards by just editing the templates class files.",
        "id": "-Kyta2X6gvz6tNeIZgyJ",
        "start_time": "2018-04-12T11:25:00-0500",
        "end_time": "2018-04-12T11:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "duration" : "20",
        "notes" : "Blogs on Template Creation : \n\n1. https://medium.com/androidstarters/mastering-android-studio-templates-ed8fdd98cb78\n2. https://medium.com/androidstarters/creating-android-studio-ide-template-for-recyclerviews-a8b6d4925f3f\n\nGithub Repository:\n\n1. https://github.com/TakeoffAndroid/RecyclerViewTemplate\n2. https://github.com/TakeoffAndroid/MaterialTabsTemplate",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 2,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["nIiy8GJDcXYiRQfIwDRV74fkA6B2"],
        "title" : "Mastering Android Studio Template Creation"
      },
      {
        "abstract" : "ConstraintLayout 2.0 will be introduced early 2018, with many new features. This talk will present those new features and concepts. If possible, we would like the abstract to be updated once the release is out.",
        "id": "-L-sGVYC5vHBmdl-2apa",
        "start_time": "2018-04-12T13:00:00-0500",
        "end_time": "2018-04-12T13:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "comments" : {
          "KJ17IrpIISTfjfCufr5rnglWoU53" : "top"
        },
        "duration" : 40,
        "notes" : "John Hoford hoford@google.com will be my co-presenter",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["hXvsojyRLxcJyWaXK8gcocL7Zlf1"],
        "title" : "ConstraintLayout 2.0"
      },
      {
        "abstract" : "Mark Allison (author of https://blog.stylingandroid,com) has a deep love of VectorDrawable. He has spoken at conferences about how to construct and Animate them in his talk entitled \"Vector All The Things\".\n\nIn this all new talk, Mark will look at some of the features which have been added to VectorDrawable and its sibling AnimatedVectorDrawable since they first appeared in Android Lollipop 5.0 (API 21). There will be a dive in to fill windings which can cause some baffling rendering oddities, yet can be quite simple to fix once you recognise that fill windings are the cause; There will also be a look at the recently added gradient support; And, of course, there will be plenty of tricks and tips to help with your creation of fabulous VectorDrawables, and amazing Animations.",
        "id": "-L-2S4rWWRVi2OlUEpRR",
        "start_time": "2018-04-12T14:00:00-0500",
        "end_time": "2018-04-12T14:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "duration" : 40,
        "notes" : "I will require flights and accommodation to be covered, but may be able to receive some financial assistance from Google toward this (for Chicago Roboto last year, Google paid for my flights, and the organisers only needed to cover my accommodation). However last year was complicated because it was left late, and flight prices has increased, and Google's budget had been largely used up. Therefore the earlier that you could confirm whether I have had a talk accepted, the more likely it is that I shall be able to get some financial assistance from Google.",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["P8iQ35ohxFTkl9z2HO7Ts1HUB0R2"],
        "title" : "wow. very vector. such love"
      },
      {
        "abstract" : "ADB is maybe one of the most used tools by the Android developers. But it is for sure the less known. \nIf you ever wondered how ADB is working? Why is it faster now? How Android Studio is using it under the hood? Why my ADB server is killed sometimes? And by the way, what this server is about? This talk is made for you. \n\nI spent several weeks diving into the ADB source code and I learned interesting things about this project, its history, the internals, the interaction with the developers tools, ... It's time for me to share this with you. \n\nHere is an outline of the presentation: \n- How ADB works (the big picture) \n- Some ADB commands you maybe never heard about \n- The history of the project \n- The ADB Internals (the ADB protocols, the structure of the software)\n- How development tools are using ADB?",
        "id": "-L0R7e0jvXReu7pzpOth",
        "start_time": "2018-04-12T15:00:00-0500",
        "end_time": "2018-04-12T15:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "duration" : "45",
        "notes" : "I already gave the talk at Droidcon NYC (https://www.youtube.com/watch?v=dzx81sAKylg) and Paris Android User Group (https://www.youtube.com/watch?v=aLNsa1Kjve8).",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["r0XXHLRqPmd3YpwBrJkkbJlZtQ62"],
        "title" : "ADB, Break On Through To the Other Side"
      },
      {
        "abstract" : "RxJava is an incredibly nice library that lets us take our data on a journey through network calls, databases, UI threads and background threads. But how do we actually achieve concurrency, responsibly? Are we testing it to ensure our own sanity? Are we protecting ourselves against race conditions? Is flatMap() and merge() enough? Demonstrating an understanding in creating and testing Rx streams helps us to achieve concurrency in this powerful library.",
        "id": "-L1DYvhOuHCYofznm459",
        "start_time": "2018-04-12T16:00:00-0500",
        "end_time": "2018-04-12T16:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "duration" : 40,
        "notes" : "Hi Chicago Roboto! I'm currently an Android Developer at Yello.co. I love working with the RxJava framework and how easy it's made our Android app to maintain.\n\nI really want to do a talk on concurrency with this widely-popular framework because, as a junior developer learning all of the pitfalls of concurrency, it's opened my eyes to all the ways we can shoot ourselves in the foot. I wrote this article (https://proandroiddev.com/testing-concurrency-in-rxjava-831804a9e526) in Pro Android Dev to contribute some of what I've learned, but I realized I could do an entire talk on the subject!\n\nI'm hoping to cover a more broad approach to concurrency and leave viewers with a more rounded-out view of how things happen in the framework.\n\nI've never spoken at a conference (at the time of the writing of this proposal) but in January I will have done a talk called Privet Kotlin at Windy City Dev Fest. Here's a link: https://windycity.devfest.io/sessions/-L0GMdpLLWSmT68IqRkO",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 2,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["GR6IHwqOLOQmwdNIlF4ETRVnAWG2"],
        "title" : "Achieving Concurrency in RxJava"
      },
      {
        "abstract" : "Are you one of the numerous developers who wants to implement Espresso testing but hasn't? Perhaps it's for one of the common reasons - not enough expertise or time, it feels like a daunting task, or it feels downright tedious. I have personally felt each of those things. All of that changed once I learned about the robot pattern. In this talk we'll go over how the robot pattern helps you write cleaner and more maintainable tests, as well as how it can be leveraged for better test reporting. You'll walk away with an understanding of how to write tests much more thoroughly and efficiently so that it can easily become a natural part of your build process, and not shoved in the back log and left untouched. \n",
        "id": "-KysBHqCHfvCEV6OaTnP",
        "start_time": "2018-04-12T17:00:00-0500",
        "end_time": "2018-04-12T17:45:00-0500",
        "date" : "2018-04-12",
        "accepted" : true,
        "duration" : 40,
        "notes" : "A short blog post I've written on this topic, though I plan for the talk to go more in depth - https://androidessence.com/android/leveraging-the-robot-pattern-for-espresso-tests/",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 2,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["KtiwOUeigvUxn0MUHtJyvCLpOnS2"],
        "title" : "Espresso Patronum: The Magic Of The Robot Pattern"
      }
    ],
    "2018-04-13": [
      {
        "abstract" : "Even if you’re brand new to Kotlin, you might know that you can right-click any Java file and convert it automatically. Score! But wait, what are all these “!!” and why is the code littered with “?”. Sure, the code compiles, but how do you make the code not just compile but follow best practices? How do you get closer to making your code idiomatic?\n\nIn the third part of our series on learning the cool and idiomatic parts of Kotlin, we're going to look at some intermediate Kotlin topics. We're going to look at how inlining can improve the performance on higher-order functions as well as allow us to take advantage of type reification. Then we'll take a look at how delegation can help us write dryer, more efficient, and more interesting properties with less boiler plate. Finally, we'll dive into the magical world of asynchronous programming the Kotlin way with coroutines.",
        "id": "-L1ZrO-T1SS0UzjrX4Gs",
        "start_time": "2018-04-13T09:00:00-0500",
        "end_time": "2018-04-13T09:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : "45",
        "notes" : "My co-presenter will be Christina Lee.\n\nBoth of us spoke at Chicago Roboto last year.\nHuyen Tue Dao, \"Cool ConstraintLayout\": https://youtu.be/Xx4aRI3oQbM\nChristina Lee, \"Retrofitting Retrofit\"\n",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["c8LiYaJFquRYKMqVmYeZgTSFaVe2"],
        "title" : "The Road to Kotlintown III: Delegate 95 to Coroutine 66"
      },
      {
        "abstract" : "Tofus (□) are representations used when a specific character (like an Emoji) cannot be displayed. You have seen them, and so your users.\n\nThanks to EmojiCompat, now Android developers have a way to provide Emoji compatibility for older devices, but does it solve all the issues developers have with Emoji? \n\nHave you wondered why Twitter counts characters differently depending on the Emoji? Or how gender and skin tone Emoji modifiers work? How can I have a similar functionality as Slack on my app with custom Emoji? Do all your users see the same Emoji?\n\nOn this talk, you will learn about the different pitfalls developers face when working with Emoji, like code points, the Fitzpatrick modifiers and short-names, you will learn how to use EmojiCompat and I will show you alternatives to it.\n\nIn this talk you will learn:\n- What are the problems developers face with Emoji\n- How Emoji works\n- How to use EmojiCompat including dynamic font downloading\n- What is EmojiCompat not solving, and what can you do\n- What alternatives are there to EmojiCompat\n- ..and of course everything with Kotlin!\n\nAfter this talk, you will be an Emoji expert, no longer afraid of showing □ (tofu) to your users!\n",
        "id": "-L-G9e3es-COhq0M650L",
        "start_time": "2018-04-13T10:00:00-0500",
        "end_time": "2018-04-13T10:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : 40,
        "notes" : "This will be an improved and extended version of the talk I gave on the Berlindroid meetup event back in summer. Here’s a summary on how the talk went: https://medium.com/@Miqubel/talk-no-more-taming-emoji-on-android-c4f3825e510c \n\nThis talk will include as well code samples for the attendees in a GitHub repo.\n\nI am very interested in this topic: At work we used to have a custom solution for displaying Emoji until EmojiCompat came out, and we used to do a lots of tricks to support the latest Unicode Emoji specs, since we are a social network that uses Emoji a lot. We are early adopters of EmojiCompat, using it since it’s beta release.\n\nI think this is an interesting topic that usually doesn’t get enough attention but can affect anyone who is dealing with user generated content.\n\nI will also be giving a talk in February on the DroidKaigi conference in Tokyo, and I’ve also given two talks at the Berlin DevFest. All of them about different topics. You can check my speaker deck: https://speakerdeck.com/miquelbeltran If you need more references, my Medium articles have been published both at AndroidWeekly and KotlinWeekly\n",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 5,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 2,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["NKfa7i1ya1codCObZxEyvBpvv5p1"],
        "title" : "No More □  —  Mastering Emoji on Android"
      },
      {
        "abstract" : "Although it is buzzing nowadays, machine learning is still a stranger to many of us.\nHowever, worry not! Making your app smarter has just become wayyy easier with the new TensorFlow for Android.\nOn this talk, we’ll get to know some basic ML concepts and usages, and create our first machine learning Android app using TensorFlow!\n",
        "id": "-L1aXPSRjrfFiFS-sksm",
        "start_time": "2018-04-13T11:00:00-0500",
        "end_time": "2018-04-13T11:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : "45",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 3,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 3,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 5,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["zzqX4y5e5yMTVLvIEfsItp4NCp52"],
        "title" : "Who’s afraid of Machine Learning? First steps with TensorFlow for Android."
      },
      {
        "abstract" : "Picasso is a powerful image downloading and caching library for Android but since its launch in 2013, other libraries have improved or entered the scene and new requirements have come up.  \n\nIn this talk, we’ll:\n* Dig into the internals of Picasso works\n* Compare and contrast to other image libraries\n* Discuss latest improvements as we push to 3.0\n* ...and more!\n\nYou’ll learn to efficiently work with different image formats across millions of devices!",
        "id": "-L1Zag9BgNhutvZebqO8",
        "start_time": "2018-04-13T13:00:00-0500",
        "end_time": "2018-04-13T13:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : 40,
        "notes" : "https://speakerdeck.com/jrodbx",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 2,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["MN4HNiWM7qW96xzbGkRphXprApu1", "ayE1XDMvl2cPi8Sa6bN45l9QLKG2"],
        "title" : "Rinsing the Brush: Picasso 3.0"
      },
      {
        "abstract" : "We have had many talks and blog posts on Dagger till now and people have done a great job at explaining it's various concepts. Dagger is something which has become a part of our coding lives now. Yet, from time-to-time we still find ourselves lost while dealing with “The Dahaka (an infinite storm in an ocean of Providers, Factories, Builders, MemberInjectors, DoubleChecks, Lazy, Producers...)”. \n\nStarting to learn about Dagger? Start by creating a Module and a Component. Add a Singleton scope to it. \nDependencies getting out of hand? Create another dependent component.\nCreating a dependent component? You should create another scope!! \nCreate a subcomponent.\nStill alive? Now we present you with Dagger Android and I am sure that it will certainly kill you :P\n\nBut wait! What exactly is the relation between a Module and a Component? \n\nThankfully! Dagger 2 generates all it’s code at compile time and we can actually see what’s going on behind the scenes.\n\nIn this talk we will aim to Defeat “The Dahaka (a storm in the ocean of generated classes)”. After attending this talk you will get a better sense of what goes on behind the scenes and how to smartly move to Dagger Android  :)\n",
        "id": "-L1453alPCtSTM9843Jy",
        "start_time": "2018-04-13T14:00:00-0500",
        "end_time": "2018-04-13T14:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : 40,
        "notes" : "For more information, series “Dagger and The Dahaka” on medium : https://proandroiddev.com/dagger-2-android-defeat-the-dahaka-b1c542233efc\n\nI gave a similar talk at Droidcon Berlin, 2017 https://droidcon.de/en/sessions/dagger-2-android-defeat-dahaka\n\nDemo code : https://github.com/ragdroid/Dahaka",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 3,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 5,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["kxTClM2ee3fSZmLQe1C4usE8Br13"],
        "title" : "Dagger 2 Android : Defeat the Dahaka"
      },
      {
        "abstract" : "Writing high-quality path morphing animations for Android is a near impossible task. In order to morph one shape into another, the SVG paths describing the two must be compatible with each other—that is, they need to have the same number and type of drawing commands. Unfortunately popular design tools, such as Sketch and Illustrator, do not take this into account, and as a result engineers will often have to spend time tweaking the raw SVGs given to them by designers before they can be morphed. To address this issue, I built a web app called Shape Shifter (https://shapeshifter.design), a tool that helps developers and designers to more easily create path morphing animations for their Android apps. In this talk, I will explain how to use Shape Shifter to create seamless transitions between arbitrary shapes using AnimatedVectorDrawables. I will also explain how Shape Shifter internally uses bioinformatics algorithms in order to auto-generate morphing animations between incompatible shapes, as well as some of the challenges I faced while building the tool.",
        "id": "-KxynTzs-dXn0PCuVJdf",
        "start_time": "2018-04-13T15:00:00-0500",
        "end_time": "2018-04-13T15:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : "45",
        "scores" : {
          "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 4,
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 5,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 3,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 4
        },
        "speakers" : ["MkYEWfwwHMeODXHCmn9yp5nsNvZ2"],
        "title" : "In-depth path morphing w/ Shape Shifter"
      },
      {
        "abstract" : "Every day each one of us turns to community contributions to help us become better developers — blog posts, open source projects, conference talks, podcasts, and so much more. Can you imagine if these community resources didn’t exist?!\n\nAnd while our community is strong today, it’s healthiest when it continues to grow from a broad set of interests, backgrounds and opinions. That diversity and knowledge to keep our community strong can only come from one place: YOU.\n\nI’ll share my thoughts about how this community has helped me (and others) grow, why that’s so important, and ultimately why it’s crucial for all of us to contribute. I’ll discuss five (or so) areas, each with some high level tips to get you started, that we can all contribute to to keep our community strong and healthy.\n\nThe Android community has proven to be one of the most welcoming, friendly, helpful, generous groups I’ve ever encountered. Let’s keep it going!",
        "id": "-L1ZPfPC0rO8qTQ3umb3",
        "start_time": "2018-04-13T16:00:00-0500",
        "end_time": "2018-04-13T16:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : "30-40",
        "notes" : "Previous talk:\nhttps://www.youtube.com/watch?v=fsUF5f4GnHc\nhttps://speakerdeck.com/dankim/getting-to-100-percent-kotlin-a-practical-guide",
        "scores" : {
          "KJ17IrpIISTfjfCufr5rnglWoU53" : 4,
          "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 4,
          "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 4,
          "umKCqMZHFnduB6OmD55XKV9ckSw1" : 2
        },
        "speakers" : ["8DqZcx3zHoOPuTT1MHM493bpfIF3"],
        "title" : "The future of our community is YOU"
      },
      {
        "abstract" : "Google introduced ARCore for Android in August of last year. This is your opportunity to step in on the ground floor of the developing potential around augmented reality on mobile. We’ll walk through some of the fundamental capabilities, things to avoid, why you might want to use it, and some resources that might be helpful for you.",
        "id": "ar-core",
        "start_time": "2018-04-13T17:00:00-0500",
        "end_time": "2018-04-13T17:45:00-0500",
        "date" : "2018-04-13",
        "accepted" : true,
        "duration" : "45",
        "speakers" : ["ngt0jsbDYDew0CUdODzMP54XU0l1"],
        "title" : "Intro to ARCore"
      }
    ]
  },
  "session_dates" : [ "2018-04-12", "2018-04-13" ],
  "speakers": {
    "ng4L290T54Q3WsqGwvS3e1TIiDG3" : {
      "id": "ng4L290T54Q3WsqGwvS3e1TIiDG3",
      "agree_terms" : true,
      "bio" : "Yash Prabhu currently leads the Android team at Warner Bros. Digital Labs. She has spoken at several meetups and industry conferences over the past three years. In her spare time, she volunteers at local tech groups as a teaching assistant, organizer and mentor. She currently co-organizes Google Developer Groups Philly and is a former DevOpsDays Philly organizer. She is also the recipient of Tech In Motion Philly's Best Tech Manager 2017 Timmy award.",
      "company" : "Warner Bros. Digital Labs",
      "email" : "yash.v.prabhu@gmail.com",
      "name" : "Yash Prabhu",
      "title" : "Android Tech Lead, Software Engineer",
      "twitter" : "@yashvprabhu"
    },
    "OiimvTKxeWcCsmaaw63VGcTdMTJ3" : {
      "id": "OiimvTKxeWcCsmaaw63VGcTdMTJ3",
      "agree_terms" : true,
      "bio" : "I love Android even more than baseball.\n\nI'm an Android developer at Shopify based in Toronto, Canada. I’ve been working with Android since 2011 and have written and contributed to a wide variety of Android applications, spanning the E-commerce, travel, and healthcare industries. When I’m not behind a keyboard, there’s a good chance I’m either at a baseball game, playing the drums or enjoying a pizza... Ideally all three.",
      "company" : "Shopify",
      "email" : "pshadlyn@gmail.com",
      "name" : "Phil Shadlyn",
      "title" : "Android Developer",
      "twitter" : "@physphil"
    },
    "U2Y8xPbQCUTxkErE7dR74dtfoly1" : {
      "id": "U2Y8xPbQCUTxkErE7dR74dtfoly1",
      "agree_terms" : true,
      "bio" : "Nate is an Android developer working on mobile apps at Udacity who believes in lifelong education and helping others do the same.  \n\nHe's worked across the android ecosystem building education products, mapping applications, as well as evolving autonomous robots.\n\nHe loves to chat about Android, tech, careers, geekery or anything else; so feel free to reach out.\n\n- Android dev at Udacity\n- Blogger\n- Co-organizer of Udacious Seattle \n- Runner\n- Self-proclaimed geek",
      "company" : "Udacity",
      "email" : "n8ebel@gmail.com",
      "name" : "Nate Ebel",
      "title" : "Android Developer",
      "twitter" : "@n8ebel"
    },
    "nIiy8GJDcXYiRQfIwDRV74fkA6B2" : {
      "id": "nIiy8GJDcXYiRQfIwDRV74fkA6B2",
      "agree_terms" : true,
      "bio" : "Android Techie geek who loves to code and contribute open source projects. I have authored 16 open source libraries and articled 30 blog posts. I am an enthusiastic coder, believes to automate all complex tasks in Android into Templates which saves hundreds of developer hours. I have contributed two major Android studio templates to the Android community for RecyclerView (https://github.com/TakeoffAndroid/RecyclerViewTemplate) and Material Tabs (https://github.com/TakeoffAndroid/MaterialTabsTemplate)\n\nGithub URL: https://github.com/TakeoffAndroid\nMedium      : https://medium.com/@takeoffandroid",
      "company" : "F22Labs",
      "email" : "chandru.androiddeveloper@gmail.com",
      "name" : "Chandrasekar K",
      "title" : "Mastering Android Studio Template Creation",
      "twitter" : "@takeoffandroid"
    },
    "hXvsojyRLxcJyWaXK8gcocL7Zlf1" : {
      "id": "hXvsojyRLxcJyWaXK8gcocL7Zlf1",
      "agree_terms" : true,
      "bio" : "Nicolas is the lead for the design tools and ConstraintLayout in Android Studio",
      "company" : "Google",
      "email" : "nicolasroard@google.com",
      "name" : "Nicolas Roard",
      "title" : "Staff Software Engineer",
      "twitter" : "@camaelon"
    },
    "P8iQ35ohxFTkl9z2HO7Ts1HUB0R2" : {
      "id": "P8iQ35ohxFTkl9z2HO7Ts1HUB0R2",
      "agree_terms" : true,
      "bio" : "Mark Allison is a GDE for Android and software engineer with over 30 years’ experience. He is passionate about providing the user with the best possible experience. He has developed both server and client side, most commonly Android on the client side, but also for iOS, HTML5, Symbian, and J2ME. Mark writes a technical blog (http://blog.stylingandroid.com) which focuses on Android UI/UX topics, but often covers more general Android development techniques. \n\nWhen not being geeky, Mark likes to unwind by hurling abuse at football referees, specifically those who are unkind to his beloved Watford FC with whom he holds a season ticket. Mark also loves single malt whisky. Buy him one and you'll have a friend for life! ",
      "company" : "Styling Android Limited",
      "email" : "mark@stylingandroid.com",
      "name" : "Mark Allison",
      "title" : "Owner",
      "twitter" : "@MarkIAllison"
    },
    "r0XXHLRqPmd3YpwBrJkkbJlZtQ62" : {
      "id": "r0XXHLRqPmd3YpwBrJkkbJlZtQ62",
      "agree_terms" : true,
      "bio" : "- Treasurer at the Paris Android User Group\n- Co-organizer of Android Makers in Paris\n- Google Developer Expert Android and IoT\n\nI've been working with Android since 2009. I took part of several R&D projects at french internet providers, then at Samsung in the Android B2B team, I also built an Android set-top box for a hotel chain, and I finally worked several years on Genymotion, an Android emulator. I recently joined Qonto a bank for freelancers, startups and SMBs.",
      "company" : "Qonto",
      "email" : "eyal.lezmy@gmail.com",
      "name" : "Eyal Lezmy",
      "title" : "Software Engineer",
      "twitter" : "@Eyal_Lezmy"
    },
    "GR6IHwqOLOQmwdNIlF4ETRVnAWG2" : {
      "id": "GR6IHwqOLOQmwdNIlF4ETRVnAWG2",
      "agree_terms" : true,
      "bio" : "Nick Cruz is an Android Engineer at Yello. He loves to explore the intricacies of RxJava and designing crisp animations for Android. At the end of the day, you can usually find him swimming laps in the pool.",
      "company" : "Yello",
      "email" : "ncruz@umich.edu",
      "name" : "Nick Cruz",
      "title" : "Android Developer",
      "twitter" : "@ReactiveNick"
    },
    "KtiwOUeigvUxn0MUHtJyvCLpOnS2" : {
      "id": "KtiwOUeigvUxn0MUHtJyvCLpOnS2",
      "agree_terms" : true,
      "bio" : "Adam is a Software Engineer, Android enthusiast, and pun aficionado. He fell in love with Android when he picked it up as a hobby in 2013 and he's been staying on top of the latest trends and contributing to open source projects ever since. Adam also strives to be an active member of the developer community - traveling the country to attend and speak at hackathons and conferences to both educate and learn from others in the community.",
      "company" : "OkCupid",
      "email" : "amcneilly331@gmail.com",
      "name" : "Adam McNeilly",
      "title" : "Software Engineer - Android",
      "twitter" : "@AdamMc331"
    },
    "c8LiYaJFquRYKMqVmYeZgTSFaVe2" : {
      "id": "c8LiYaJFquRYKMqVmYeZgTSFaVe2",
      "agree_terms" : true,
      "bio" : "Huyen Tue Dao is an Android developer and Google Developer Expert, currently working on the Trello Android app at Atlassian. She is also co-creator of the \"Android Dialogs\" YouTube channel.\n\nHuyen lives in Denver, CO though is often found in the DC Metro area. When she is not up late programming, she is often found up late gaming (video, board, card, anything).",
      "company" : "Trello @ Atlassian / Android Dialogs",
      "email" : "daotueh@gmail.com",
      "name" : "Huyen Tue Dao",
      "title" : "Android Developer",
      "twitter" : "@queencodemonkey"
    },
    "NKfa7i1ya1codCObZxEyvBpvv5p1" : {
      "id": "NKfa7i1ya1codCObZxEyvBpvv5p1",
      "agree_terms" : true,
      "bio" : "Miquel is an Android developer based in Berlin, Germany. He got in Android in 2012 when he started building video player SDKs for streaming apps. Currently he is leading the small Android team of Nebenan.de. Miquel is also an active member of the tech community in Berlin, where he has conducted workshops and talks.",
      "company" : "Nebenan.de",
      "email" : "mike513@gmail.com",
      "name" : "Miquel Beltran",
      "title" : "Lead Android Dev.",
      "twitter" : "@Miqubel"
    },
    "zzqX4y5e5yMTVLvIEfsItp4NCp52" : {
      "id": "zzqX4y5e5yMTVLvIEfsItp4NCp52",
      "agree_terms" : true,
      "bio" : "Britt, is a Google Developer Expert for Android, born and raised in Israel, the “Startup Nation”, where she has started and lead the mobile teams on various startup companies.\n\nPassionate about Android, she is co-leading Android Academy TLV which is one of the largest and most active Android communities out there. \nShe is a public speaker, a mentor at Google Campus TLV, and a blogger about Android development.\nBritt is also Women Techmakers Israel community lead and act to promote diversity in the tech industry.",
      "company" : "Android Academy",
      "email" : "britt.barak@gmail.com",
      "name" : "Britt Barak",
      "title" : "Google Developer Expert",
      "twitter" : "@brittBarak"
    },
    "MN4HNiWM7qW96xzbGkRphXprApu1" : {
      "id": "MN4HNiWM7qW96xzbGkRphXprApu1",
      "agree_terms" : true,
      "bio" : "Android engineer on Square Cash. Contributor to LeakCanary. Previously at Amplify and Major League Baseball.",
      "company" : "Square",
      "email" : "john.rodriguez@gmail.com",
      "name" : "John Rodriguez",
      "title" : "Software Engineer",
      "twitter" : "@jrodbx"
    },
    "ayE1XDMvl2cPi8Sa6bN45l9QLKG2" : {
      "id": "ayE1XDMvl2cPi8Sa6bN45l9QLKG2",
      "agree_terms" : true,
      "bio" : "Android engineer at Google working on Kotlin things. Has a long-time severe allergy to boilerplate code and for years has been raising awareness on the issue as well as leading efforts to eradicate this horrible disease that plagues modern developers.",
      "company" : "Google, Inc.",
      "email" : "jakewharton@gmail.com",
      "name" : "Jake Wharton",
      "title" : "Software Engineer",
      "twitter" : "@JakeWharton"
    },
    "kxTClM2ee3fSZmLQe1C4usE8Br13" : {
      "id": "kxTClM2ee3fSZmLQe1C4usE8Br13",
      "agree_terms" : true,
      "bio" : "She is a computer science post-graduate, currently working a Senior Android Engineer at Fueled having an experience of 4 years in this domain. At Fueled she has worked with some startups and also top clients such as Barnes and Noble College, Barneys New York, Rite Aid Pharmacy, Walc, Pezo and others. She is also a technical speaker and has so far presented at Droidcon India, Droidcon Boston, Droidcon Berlin and some local meetups.",
      "company" : "Fueled",
      "email" : "garima.my.way@gmail.com",
      "name" : "Garima Jain",
      "title" : "Senior Android Engineer",
      "twitter" : "@ragdroid"
    },
    "MkYEWfwwHMeODXHCmn9yp5nsNvZ2" : {
      "id": "MkYEWfwwHMeODXHCmn9yp5nsNvZ2",
      "agree_terms" : true,
      "bio" : "Alex is an Android designer & developer who helps other designers and developers to understand and create beautiful material design apps.",
      "company" : "Lyft",
      "email" : "alexjlockwood@gmail.com",
      "name" : "Alex Lockwood",
      "title" : "Software Engineer",
      "twitter" : "@alexjlockwood"
    },
    "8DqZcx3zHoOPuTT1MHM493bpfIF3" : {
      "id": "8DqZcx3zHoOPuTT1MHM493bpfIF3",
      "agree_terms" : true,
      "bio" : "Dan has been an Android programmer at Basecamp for 3 years, and prior to that had been working with Java for...a long time. \n\nHe's always enjoyed Android development, but working with Kotlin over the last two years has rocketed that enthusiasm to a whole new level. The Android community has been instrumental to his work and career, and he's a big believer in paying that forward.\n\nOutside of work, he's an avid Dad 👴, donut aficionado 🍩, pizza lover 🍕, and emoji enthusiast 😉.",
      "company" : "Basecamp",
      "email" : "dan@basecamp.com",
      "name" : "Dan Kim",
      "title" : "Programmer",
      "twitter" : "@dankim"
    },
    "ngt0jsbDYDew0CUdODzMP54XU0l1" : {
      "id": "ngt0jsbDYDew0CUdODzMP54XU0l1",
      "agree_terms" : true,
      "bio" : "Patrick has been doing Android engineering since 2012, and he loves it. When he’s not making Android apps or following Android news, you can find him helping organize for Google Developer Group Twin Cities, riding his bike, or taking all of the tastiest food photos.",
      "company" : "The Nerdery",
      "email" : "fuentespatrick@gmail.com",
      "name" : "Patrick Fuentes",
      "title" : "Principal Software Engineer; Android Domain Lead",
      "twitter" : "@pfue"
    }
  },
  "submissions" : {
    "-KxUm9laVRcLuGXa9j6g" : {
      "abstract" : "This is a test that should be deleted.",
      "accepted" : false,
      "comments" : {
        "KJ17IrpIISTfjfCufr5rnglWoU53" : "trolls"
      },
      "duration" : 40,
      "notes" : "Everything is awesome!",
      "scores" : {
        "8DqZcx3zHoOPuTT1MHM493bpfIF3" : 1,
        "KJ17IrpIISTfjfCufr5rnglWoU53" : 1,
        "OrviRlXkHySeGk9LorOCrV6kCwI3" : 1,
        "o1Rg9v9Q1LcFsA4ZWnpsFDOIF8Y2" : 1,
        "uVl7STcR5uXVn00h5hCtn2Ptz6D2" : 1,
        "umKCqMZHFnduB6OmD55XKV9ckSw1" : 1
      },
      "speaker_id" : "OrviRlXkHySeGk9LorOCrV6kCwI3",
      "title" : "Test Submission"
    }
  },
  "venue" : {
    "address" : "247 E Ontario St, Chicago, IL 60611",
    "latitude" : 41.89321169999999,
    "longitude" : -87.62081,
    "name" : "Chez Chicago",
    "phone" : "(312) 255-0288",
    "rooms" : [ "Main" ]
  }
}
